README.org
Lincoln Home Market (Eric Brown)

* Content

  Static Pages with CMS (use comfy mexican sofa)

  - [ ] Static Pages

    : rails g controller StaticPages home about openHouse listings buyers sellers acreage resources

    [[./config/routes.rb]]

    - [ ] Home
    - [ ] About
    - [ ] Open House

      - [ ] Calendar
    - [ ] Listings
      
      - [ ] Model after PH staff page
      - [ ] Map
    - [ ] Buyers
    - [ ] Sellers
    - [ ] Acreage
    - [ ] Lincoln Resources

  - [ ] CMS (comfy)

    https://github.com/comfy/comfortable-mexican-sofa

    : gem 'comfortable_mexican_sofa', '~> 1.12.0'

    dependent upon bootstrap-sass ~> 3.1.0

    : bundle install
    : rails g comfy:cms
    : rake db:migrate

    restart server

    in routes file, make sure the following line is last
    : 'comfy_route :cms, :path => '/', :sitemap => false

    update password using ENV

    [[./config/initializers/comfortable_mexican_sofa.rb]]

    : ComfortableMexicanSofa::HttpAuth.username = ENV["COMFY_USERNAME"]
    : ComfortableMexicanSofa::HttpAuth.password = ENV["COMFY_PASSWORD"]

    set ENV in .env (make sure in .gitignore)

    set ENV in heroku

    : heroku config:set COMFY_USERNAME='username'
    : heroku config:set COMFY_PASSWORD='password'

  - [ ] Menu
    
    Home, About, Listings, Buyers, Acreage (windmill pic)

* Application

  In the future, Eric would like a blog feature

* Style

  - [ ] Model after new Prairie Hill website, with similar features to http://kentshomes.com

  - [ ] Imagery

    - [ ] Contact Steve Andel regarding photography

  - [ ] Bootstrap

  - [ ] Skrollr

    https://github.com/reed/skrollr-rails

    ???"@import 'skrollr';" in [[./app/assets/stylesheets/bootstrap_and_customization.css.scss]]?

    - [X] add skrollr script

      - [X] make sure skrollr-rails is in the Gemfile

        [[./Gemfile]]

	: gem 'skrollr-rails'

      - [X] add the following script just before </body> tag

	[[./app/views/layouts/application.html.erb]]

	: <script>
        :  (function($){
	:    skrollr.init({
	:      forceHeight: false,
	:      smoothScrolling: false
	:    }).refresh();
        :  } (jQuery));
	: </script>

      - [X] Place #skrollr-body div tag around <%= yield %> tag

	: <div id="skrollr-body">


    - [X] require skrollr in application.js

      [[./app/assets/javascripts/application.js]]

      : //= require skrollr

      - [X] For IE compatibility

	: //= require skrollr
	: //= require skrollr.ie

      - [X] This plugin makes hashlinks scroll nicely to their target position.

	: //= require skrollr
	: //= require skrollr.menu
      

* Communication

  - [ ] Contact Mailer

      http://rubyonrailshelp.wordpress.com/2014/01/08/rails-4-simple-form-and-mail-form-to-make-contact-form/

* Requirements

* Configuration

  - [ ] [[./config/routes.rb]]
  - [ ] [[./Gemfile]]


