README.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>README</title>
<!-- 2014-08-25 Mon 21:27 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Ander" />
</head>
<body>
<div id="content">
<h1 class="title">README</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. Content</a></li>
<li><a href="#sec-2">2. Application</a></li>
<li><a href="#sec-3">3. Style</a></li>
<li><a href="#sec-4">4. Communication</a></li>
<li><a href="#sec-5">5. Requirements</a></li>
<li><a href="#sec-6">6. Configuration</a></li>
</ul>
</div>
</div>
<p>
Lincoln Home Market (Eric Brown)
</p>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Content</h2>
<div class="outline-text-2" id="text-1">
<p>
Static Pages with CMS (use comfy mexican sofa)
</p>

<ul class="org-ul">
<li><code>[&#xa0;]</code> Static Pages

<pre class="example">
rails g controller StaticPages home about openHouse listings buyers sellers acreage resources
</pre>

<p>
<a href="./config/routes.rb">./config/routes.rb</a>
</p>

<ul class="org-ul">
<li><code>[&#xa0;]</code> Home
</li>
<li><code>[&#xa0;]</code> About
</li>
<li><code>[&#xa0;]</code> Open House

<ul class="org-ul">
<li><code>[&#xa0;]</code> Calendar
</li>
</ul>
</li>
<li><code>[&#xa0;]</code> Listings

<ul class="org-ul">
<li><code>[&#xa0;]</code> Model after PH staff page
</li>
<li><code>[&#xa0;]</code> Map
</li>
</ul>
</li>
<li><code>[&#xa0;]</code> Buyers
</li>
<li><code>[&#xa0;]</code> Sellers
</li>
<li><code>[&#xa0;]</code> Acreage
</li>
<li><code>[&#xa0;]</code> Lincoln Resources
</li>
</ul>
</li>

<li><code>[&#xa0;]</code> CMS (comfy)

<p>
<a href="https://github.com/comfy/comfortable-mexican-sofa">https://github.com/comfy/comfortable-mexican-sofa</a>
</p>

<pre class="example">
gem 'comfortable_mexican_sofa', '~&gt; 1.12.0'
</pre>

<p>
dependent upon bootstrap-sass ~&gt; 3.1.0
</p>

<pre class="example">
bundle install
rails g comfy:cms
rake db:migrate
</pre>

<p>
restart server
</p>

<p>
in routes file, make sure the following line is last
</p>
<pre class="example">
'comfy_route :cms, :path =&gt; '/', :sitemap =&gt; false
</pre>

<p>
update password using ENV
</p>

<p>
<a href="./config/initializers/comfortable_mexican_sofa.rb">./config/initializers/comfortable_mexican_sofa.rb</a>
</p>

<pre class="example">
ComfortableMexicanSofa::HttpAuth.username = ENV["COMFY_USERNAME"]
ComfortableMexicanSofa::HttpAuth.password = ENV["COMFY_PASSWORD"]
</pre>

<p>
set ENV in .env (make sure in .gitignore)
</p>

<p>
set ENV in heroku
</p>

<pre class="example">
heroku config:set COMFY_USERNAME='username'
heroku config:set COMFY_PASSWORD='password'
</pre>
</li>

<li><code>[&#xa0;]</code> Menu

<p>
Home, About, Listings, Buyers, Acreage (windmill pic)
</p>
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Application</h2>
<div class="outline-text-2" id="text-2">
<p>
In the future, Eric would like a blog feature
</p>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Style</h2>
<div class="outline-text-2" id="text-3">
<ul class="org-ul">
<li><code>[&#xa0;]</code> Model after new Prairie Hill website, with similar features to <a href="http://kentshomes.com">http://kentshomes.com</a>
</li>

<li><code>[&#xa0;]</code> Imagery

<ul class="org-ul">
<li><code>[&#xa0;]</code> Contact Steve Andel regarding photography
</li>
</ul>
</li>

<li><code>[&#xa0;]</code> Bootstrap
</li>

<li><code>[&#xa0;]</code> Skrollr

<p>
<a href="https://github.com/reed/skrollr-rails">https://github.com/reed/skrollr-rails</a>
</p>

<p>
???"@import 'skrollr';" in <a href="./app/assets/stylesheets/bootstrap_and_customization.css.scss">./app/assets/stylesheets/bootstrap_and_customization.css.scss</a>?
</p>

<ul class="org-ul">
<li><code>[X]</code> add skrollr script

<ul class="org-ul">
<li><code>[X]</code> make sure skrollr-rails is in the Gemfile

<p>
<a href="./Gemfile">./Gemfile</a>
</p>

<pre class="example">
gem 'skrollr-rails'
</pre>
</li>

<li><code>[X]</code> add the following script just before &lt;/body&gt; tag

<p>
<a href="./app/views/layouts/application.html.erb">./app/views/layouts/application.html.erb</a>
</p>

<pre class="example">
&lt;script&gt;
 (function($){
   skrollr.init({
     forceHeight: false,
     smoothScrolling: false
   }).refresh();
 } (jQuery));
&lt;/script&gt;
</pre>
</li>

<li><code>[X]</code> Place #skrollr-body div tag around &lt;%= yield %&gt; tag

<pre class="example">
&lt;div id="skrollr-body"&gt;
</pre>
</li>
</ul>
</li>
</ul>
</li>
</ul>


<ul class="org-ul">
<li><code>[X]</code> require skrollr in application.js

<p>
<a href="./app/assets/javascripts/application.js">./app/assets/javascripts/application.js</a>
</p>

<pre class="example">
//= require skrollr
</pre>

<ul class="org-ul">
<li><code>[X]</code> For IE compatibility

<pre class="example">
//= require skrollr
//= require skrollr.ie
</pre>
</li>

<li><code>[X]</code> This plugin makes hashlinks scroll nicely to their target position.

<pre class="example">
//= require skrollr
//= require skrollr.menu
</pre>
</li>
</ul>
</li>
</ul>
</div>
</div>


<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> Communication</h2>
<div class="outline-text-2" id="text-4">
<ul class="org-ul">
<li><code>[&#xa0;]</code> Contact Mailer

<p>
<a href="http://rubyonrailshelp.wordpress.com/2014/01/08/rails-4-simple-form-and-mail-form-to-make-contact-form/">http://rubyonrailshelp.wordpress.com/2014/01/08/rails-4-simple-form-and-mail-form-to-make-contact-form/</a>
</p>
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> Requirements</h2>
</div>

<div id="outline-container-sec-6" class="outline-2">
<h2 id="sec-6"><span class="section-number-2">6</span> Configuration</h2>
<div class="outline-text-2" id="text-6">
<ul class="org-ul">
<li><code>[&#xa0;]</code> <a href="./config/routes.rb">./config/routes.rb</a>
</li>
<li><code>[&#xa0;]</code> <a href="./Gemfile">./Gemfile</a>
</li>
</ul>
</div>
</div>
</div>
</body>
</html>
